HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_bf.h
/** \brief Length for Ifx_MCDS_TCYID_MSK_Bits.MASK */
#define IFX_MCDS_TCYID_MSK_MASK_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCYID_MSK_Bits.MASK */
#define IFX_MCDS_TCYID_MSK_MASK_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCYID_MSK_Bits.MASK */
#define IFX_MCDS_TCYID_MSK_MASK_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYID_SGN_Bits.SIGN */
#define IFX_MCDS_TCYID_SGN_SIGN_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCYID_SGN_Bits.SIGN */
#define IFX_MCDS_TCYID_SGN_SIGN_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCYID_SGN_Bits.SIGN */
#define IFX_MCDS_TCYID_SGN_SIGN_OFF (0u)

/** \brief Length for Ifx_MCDS_TCYIP_BND_Bits.BOUND */
#define IFX_MCDS_TCYIP_BND_BOUND_LEN (31u)

/** \brief Mask for Ifx_MCDS_TCYIP_BND_Bits.BOUND */
#define IFX_MCDS_TCYIP_BND_BOUND_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDS_TCYIP_BND_Bits.BOUND */
#define IFX_MCDS_TCYIP_BND_BOUND_OFF (1u)

/** \brief Length for Ifx_MCDS_TCYIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCYIP_RNG_RANGE_LEN (31u)

/** \brief Mask for Ifx_MCDS_TCYIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCYIP_RNG_RANGE_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDS_TCYIP_RNG_Bits.RANGE */
#define IFX_MCDS_TCYIP_RNG_RANGE_OFF (1u)

/** \brief Length for Ifx_MCDS_SPBDCSTS_Bits.EI */
#define IFX_MCDS_SPBDCSTS_EI_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBDCSTS_Bits.EI */
#define IFX_MCDS_SPBDCSTS_EI_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBDCSTS_Bits.EI */
#define IFX_MCDS_SPBDCSTS_EI_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBDCSTS_Bits.SUS */
#define IFX_MCDS_SPBDCSTS_SUS_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBDCSTS_Bits.SUS */
#define IFX_MCDS_SPBDCSTS_SUS_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBDCSTS_Bits.SUS */
#define IFX_MCDS_SPBDCSTS_SUS_OFF (1u)

/** \brief Length for Ifx_MCDS_SPBDCSTS_Bits.ERR */
#define IFX_MCDS_SPBDCSTS_ERR_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBDCSTS_Bits.ERR */
#define IFX_MCDS_SPBDCSTS_ERR_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBDCSTS_Bits.ERR */
#define IFX_MCDS_SPBDCSTS_ERR_OFF (2u)

/** \brief Length for Ifx_MCDS_SPBDCSTS_Bits.RTY */
#define IFX_MCDS_SPBDCSTS_RTY_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBDCSTS_Bits.RTY */
#define IFX_MCDS_SPBDCSTS_RTY_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBDCSTS_Bits.RTY */
#define IFX_MCDS_SPBDCSTS_RTY_OFF (3u)

/** \brief Length for Ifx_MCDS_SPBDCSTS_Bits.SYSRES */
#define IFX_MCDS_SPBDCSTS_SYSRES_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBDCSTS_Bits.SYSRES */
#define IFX_MCDS_SPBDCSTS_SYSRES_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBDCSTS_Bits.SYSRES */
#define IFX_MCDS_SPBDCSTS_SYSRES_OFF (4u)

/** \brief Length for Ifx_MCDS_SPBDCSTS_Bits.APPRES */
#define IFX_MCDS_SPBDCSTS_APPRES_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBDCSTS_Bits.APPRES */
#define IFX_MCDS_SPBDCSTS_APPRES_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBDCSTS_Bits.APPRES */
#define IFX_MCDS_SPBDCSTS_APPRES_OFF (5u)

/** \brief Length for Ifx_MCDS_SPBDCSTS_Bits.CLKDIV */
#define IFX_MCDS_SPBDCSTS_CLKDIV_LEN (2u)

/** \brief Mask for Ifx_MCDS_SPBDCSTS_Bits.CLKDIV */
#define IFX_MCDS_SPBDCSTS_CLKDIV_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SPBDCSTS_Bits.CLKDIV */
#define IFX_MCDS_SPBDCSTS_CLKDIV_OFF (6u)

/** \brief Length for Ifx_MCDS_SPBDCSTS_Bits.SAFEEI */
#define IFX_MCDS_SPBDCSTS_SAFEEI_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBDCSTS_Bits.SAFEEI */
#define IFX_MCDS_SPBDCSTS_SAFEEI_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBDCSTS_Bits.SAFEEI */
#define IFX_MCDS_SPBDCSTS_SAFEEI_OFF (8u)

/** \brief Length for Ifx_MCDS_SPBDCSTS_Bits.SLEEP */
#define IFX_MCDS_SPBDCSTS_SLEEP_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBDCSTS_Bits.SLEEP */
#define IFX_MCDS_SPBDCSTS_SLEEP_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBDCSTS_Bits.SLEEP */
#define IFX_MCDS_SPBDCSTS_SLEEP_OFF (9u)

/** \brief Length for Ifx_MCDS_SPBEA_BND_Bits.BOUND */
#define IFX_MCDS_SPBEA_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDS_SPBEA_BND_Bits.BOUND */
#define IFX_MCDS_SPBEA_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SPBEA_BND_Bits.BOUND */
#define IFX_MCDS_SPBEA_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBEA_RNG_Bits.RANGE */
#define IFX_MCDS_SPBEA_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDS_SPBEA_RNG_Bits.RANGE */
#define IFX_MCDS_SPBEA_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SPBEA_RNG_Bits.RANGE */
#define IFX_MCDS_SPBEA_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBWD_BND_Bits.BOUND */
#define IFX_MCDS_SPBWD_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDS_SPBWD_BND_Bits.BOUND */
#define IFX_MCDS_SPBWD_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SPBWD_BND_Bits.BOUND */
#define IFX_MCDS_SPBWD_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBWD_RNG_Bits.RANGE */
#define IFX_MCDS_SPBWD_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDS_SPBWD_RNG_Bits.RANGE */
#define IFX_MCDS_SPBWD_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SPBWD_RNG_Bits.RANGE */
#define IFX_MCDS_SPBWD_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBWD_MSK_Bits.MASK */
#define IFX_MCDS_SPBWD_MSK_MASK_LEN (32u)

/** \brief Mask for Ifx_MCDS_SPBWD_MSK_Bits.MASK */
#define IFX_MCDS_SPBWD_MSK_MASK_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SPBWD_MSK_Bits.MASK */
#define IFX_MCDS_SPBWD_MSK_MASK_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBWD_SGN_Bits.SIGN */
#define IFX_MCDS_SPBWD_SGN_SIGN_LEN (5u)

/** \brief Mask for Ifx_MCDS_SPBWD_SGN_Bits.SIGN */
#define IFX_MCDS_SPBWD_SGN_SIGN_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_SPBWD_SGN_Bits.SIGN */
#define IFX_MCDS_SPBWD_SGN_SIGN_OFF (0u)

/** \brief Length for Ifx_MCDS_SPBWD_SGN_Bits.EITHER */
#define IFX_MCDS_SPBWD_SGN_EITHER_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBWD_SGN_Bits.EITHER */
#define IFX_MCDS_SPBWD_SGN_EITHER_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBWD_SGN_Bits.EITHER */
#define IFX_MCDS_SPBWD_SGN_EITHER_OFF (14u)

/** \brief Length for Ifx_MCDS_SPBWD_SGN_Bits.BELOW */
#define IFX_MCDS_SPBWD_SGN_BELOW_LEN (1u)

/** \brief Mask for Ifx_MCDS_SPBWD_SGN_Bits.BELOW */
#define IFX_MCDS_SPBWD_SGN_BELOW_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SPBWD_SGN_Bits.BELOW */
#define IFX_MCDS_SPBWD_SGN_BELOW_OFF (15u)

/** \brief Length for Ifx_MCDS_SPBWD_SGN_Bits.RELOAD */
#define IFX_MCDS_SPBWD_SGN_RELOAD_LEN (4u)

/** \brief Mask for Ifx_MCDS_SPBWD_SGN_Bits.RELOAD */
#define IFX_MCDS_SPBWD_SGN_RELOAD_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_SPBWD_SGN_Bits.RELOAD */
#define IFX_MCDS_SPBWD_SGN_RELOAD_OFF (16u)

