HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_bf.h
/** \brief Offset for Ifx_MCDS_SRI1BALLUTA_Bits.ADDR */
#define IFX_MCDS_SRI1BALLUTA_ADDR_OFF (2u)

/** \brief Length for Ifx_MCDS_SRI1BAL_BND_Bits.BOUND */
#define IFX_MCDS_SRI1BAL_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI1BAL_BND_Bits.BOUND */
#define IFX_MCDS_SRI1BAL_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI1BAL_BND_Bits.BOUND */
#define IFX_MCDS_SRI1BAL_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI1BAL_RNG_Bits.RANGE */
#define IFX_MCDS_SRI1BAL_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI1BAL_RNG_Bits.RANGE */
#define IFX_MCDS_SRI1BAL_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI1BAL_RNG_Bits.RANGE */
#define IFX_MCDS_SRI1BAL_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI1BAL_MAP_Bits.OFFSET */
#define IFX_MCDS_SRI1BAL_MAP_OFFSET_LEN (10u)

/** \brief Mask for Ifx_MCDS_SRI1BAL_MAP_Bits.OFFSET */
#define IFX_MCDS_SRI1BAL_MAP_OFFSET_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_SRI1BAL_MAP_Bits.OFFSET */
#define IFX_MCDS_SRI1BAL_MAP_OFFSET_OFF (5u)

/** \brief Length for Ifx_MCDS_SRI1BAL_MAP_Bits.GRAIN */
#define IFX_MCDS_SRI1BAL_MAP_GRAIN_LEN (3u)

/** \brief Mask for Ifx_MCDS_SRI1BAL_MAP_Bits.GRAIN */
#define IFX_MCDS_SRI1BAL_MAP_GRAIN_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_SRI1BAL_MAP_Bits.GRAIN */
#define IFX_MCDS_SRI1BAL_MAP_GRAIN_OFF (28u)

/** \brief Length for Ifx_MCDS_SRI1BAL_MAP_Bits.EN */
#define IFX_MCDS_SRI1BAL_MAP_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRI1BAL_MAP_Bits.EN */
#define IFX_MCDS_SRI1BAL_MAP_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRI1BAL_MAP_Bits.EN */
#define IFX_MCDS_SRI1BAL_MAP_EN_OFF (31u)

/** \brief Length for Ifx_MCDS_SRI2BALLUTD_Bits.DATA */
#define IFX_MCDS_SRI2BALLUTD_DATA_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI2BALLUTD_Bits.DATA */
#define IFX_MCDS_SRI2BALLUTD_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI2BALLUTD_Bits.DATA */
#define IFX_MCDS_SRI2BALLUTD_DATA_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2BALLUTA_Bits.ADDR */
#define IFX_MCDS_SRI2BALLUTA_ADDR_LEN (10u)

/** \brief Mask for Ifx_MCDS_SRI2BALLUTA_Bits.ADDR */
#define IFX_MCDS_SRI2BALLUTA_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_SRI2BALLUTA_Bits.ADDR */
#define IFX_MCDS_SRI2BALLUTA_ADDR_OFF (2u)

/** \brief Length for Ifx_MCDS_SRI2BAL_BND_Bits.BOUND */
#define IFX_MCDS_SRI2BAL_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI2BAL_BND_Bits.BOUND */
#define IFX_MCDS_SRI2BAL_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI2BAL_BND_Bits.BOUND */
#define IFX_MCDS_SRI2BAL_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2BAL_RNG_Bits.RANGE */
#define IFX_MCDS_SRI2BAL_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI2BAL_RNG_Bits.RANGE */
#define IFX_MCDS_SRI2BAL_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI2BAL_RNG_Bits.RANGE */
#define IFX_MCDS_SRI2BAL_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2BAL_MAP_Bits.OFFSET */
#define IFX_MCDS_SRI2BAL_MAP_OFFSET_LEN (10u)

/** \brief Mask for Ifx_MCDS_SRI2BAL_MAP_Bits.OFFSET */
#define IFX_MCDS_SRI2BAL_MAP_OFFSET_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_SRI2BAL_MAP_Bits.OFFSET */
#define IFX_MCDS_SRI2BAL_MAP_OFFSET_OFF (5u)

/** \brief Length for Ifx_MCDS_SRI2BAL_MAP_Bits.GRAIN */
#define IFX_MCDS_SRI2BAL_MAP_GRAIN_LEN (3u)

/** \brief Mask for Ifx_MCDS_SRI2BAL_MAP_Bits.GRAIN */
#define IFX_MCDS_SRI2BAL_MAP_GRAIN_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_SRI2BAL_MAP_Bits.GRAIN */
#define IFX_MCDS_SRI2BAL_MAP_GRAIN_OFF (28u)

/** \brief Length for Ifx_MCDS_SRI2BAL_MAP_Bits.EN */
#define IFX_MCDS_SRI2BAL_MAP_EN_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRI2BAL_MAP_Bits.EN */
#define IFX_MCDS_SRI2BAL_MAP_EN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRI2BAL_MAP_Bits.EN */
#define IFX_MCDS_SRI2BAL_MAP_EN_OFF (31u)

/** \brief Length for Ifx_MCDS_SRI1EA_BND_Bits.BOUND */
#define IFX_MCDS_SRI1EA_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI1EA_BND_Bits.BOUND */
#define IFX_MCDS_SRI1EA_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI1EA_BND_Bits.BOUND */
#define IFX_MCDS_SRI1EA_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI1EA_RNG_Bits.RANGE */
#define IFX_MCDS_SRI1EA_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI1EA_RNG_Bits.RANGE */
#define IFX_MCDS_SRI1EA_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI1EA_RNG_Bits.RANGE */
#define IFX_MCDS_SRI1EA_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI1WD_BND_Bits.BOUND_31_0 */
#define IFX_MCDS_SRI1WD_BND_BOUND_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI1WD_BND_Bits.BOUND_31_0 */
#define IFX_MCDS_SRI1WD_BND_BOUND_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI1WD_BND_Bits.BOUND_31_0 */
#define IFX_MCDS_SRI1WD_BND_BOUND_31_0_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI1WD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDS_SRI1WD_HBND_BOUND_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI1WD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDS_SRI1WD_HBND_BOUND_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI1WD_HBND_Bits.BOUND_63_32 */
#define IFX_MCDS_SRI1WD_HBND_BOUND_63_32_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI1WD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDS_SRI1WD_RNG_RANGE_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI1WD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDS_SRI1WD_RNG_RANGE_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI1WD_RNG_Bits.RANGE_31_0 */
#define IFX_MCDS_SRI1WD_RNG_RANGE_31_0_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI1WD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_SRI1WD_HRNG_RANGE_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI1WD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_SRI1WD_HRNG_RANGE_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI1WD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_SRI1WD_HRNG_RANGE_63_32_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI1WD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_SRI1WD_MSK_MASK_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI1WD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_SRI1WD_MSK_MASK_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI1WD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_SRI1WD_MSK_MASK_31_0_OFF (0u)

