HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_bf.h
/** \brief Length for Ifx_MCDS_SRI2WD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_SRI2WD_HRNG_RANGE_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI2WD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_SRI2WD_HRNG_RANGE_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI2WD_HRNG_Bits.RANGE_63_32 */
#define IFX_MCDS_SRI2WD_HRNG_RANGE_63_32_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2WD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_SRI2WD_MSK_MASK_31_0_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI2WD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_SRI2WD_MSK_MASK_31_0_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI2WD_MSK_Bits.MASK_31_0 */
#define IFX_MCDS_SRI2WD_MSK_MASK_31_0_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2WD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDS_SRI2WD_HMSK_MASK_63_32_LEN (32u)

/** \brief Mask for Ifx_MCDS_SRI2WD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDS_SRI2WD_HMSK_MASK_63_32_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_SRI2WD_HMSK_Bits.MASK_63_32 */
#define IFX_MCDS_SRI2WD_HMSK_MASK_63_32_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2WD_SGN_Bits.SIGN */
#define IFX_MCDS_SRI2WD_SGN_SIGN_LEN (6u)

/** \brief Mask for Ifx_MCDS_SRI2WD_SGN_Bits.SIGN */
#define IFX_MCDS_SRI2WD_SGN_SIGN_MSK (0x3fu)

/** \brief Offset for Ifx_MCDS_SRI2WD_SGN_Bits.SIGN */
#define IFX_MCDS_SRI2WD_SGN_SIGN_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2WD_SGN_Bits.EITHER */
#define IFX_MCDS_SRI2WD_SGN_EITHER_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRI2WD_SGN_Bits.EITHER */
#define IFX_MCDS_SRI2WD_SGN_EITHER_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRI2WD_SGN_Bits.EITHER */
#define IFX_MCDS_SRI2WD_SGN_EITHER_OFF (14u)

/** \brief Length for Ifx_MCDS_SRI2WD_SGN_Bits.BELOW */
#define IFX_MCDS_SRI2WD_SGN_BELOW_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRI2WD_SGN_Bits.BELOW */
#define IFX_MCDS_SRI2WD_SGN_BELOW_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRI2WD_SGN_Bits.BELOW */
#define IFX_MCDS_SRI2WD_SGN_BELOW_OFF (15u)

/** \brief Length for Ifx_MCDS_SRI2WD_SGN_Bits.RELOAD */
#define IFX_MCDS_SRI2WD_SGN_RELOAD_LEN (4u)

/** \brief Mask for Ifx_MCDS_SRI2WD_SGN_Bits.RELOAD */
#define IFX_MCDS_SRI2WD_SGN_RELOAD_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_SRI2WD_SGN_Bits.RELOAD */
#define IFX_MCDS_SRI2WD_SGN_RELOAD_OFF (16u)

/** \brief Length for Ifx_MCDS_SRI2AC_BND_Bits.BOUND */
#define IFX_MCDS_SRI2AC_BND_BOUND_LEN (14u)

/** \brief Mask for Ifx_MCDS_SRI2AC_BND_Bits.BOUND */
#define IFX_MCDS_SRI2AC_BND_BOUND_MSK (0x3fffu)

/** \brief Offset for Ifx_MCDS_SRI2AC_BND_Bits.BOUND */
#define IFX_MCDS_SRI2AC_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2AC_RNG_Bits.RANGE */
#define IFX_MCDS_SRI2AC_RNG_RANGE_LEN (14u)

/** \brief Mask for Ifx_MCDS_SRI2AC_RNG_Bits.RANGE */
#define IFX_MCDS_SRI2AC_RNG_RANGE_MSK (0x3fffu)

/** \brief Offset for Ifx_MCDS_SRI2AC_RNG_Bits.RANGE */
#define IFX_MCDS_SRI2AC_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2AC_MSK_Bits.SVM */
#define IFX_MCDS_SRI2AC_MSK_SVM_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRI2AC_MSK_Bits.SVM */
#define IFX_MCDS_SRI2AC_MSK_SVM_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRI2AC_MSK_Bits.SVM */
#define IFX_MCDS_SRI2AC_MSK_SVM_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2AC_MSK_Bits.MASTER */
#define IFX_MCDS_SRI2AC_MSK_MASTER_LEN (4u)

/** \brief Mask for Ifx_MCDS_SRI2AC_MSK_Bits.MASTER */
#define IFX_MCDS_SRI2AC_MSK_MASTER_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_SRI2AC_MSK_Bits.MASTER */
#define IFX_MCDS_SRI2AC_MSK_MASTER_OFF (1u)

/** \brief Length for Ifx_MCDS_SRI2AC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDS_SRI2AC_MSK_SUBCHANNEL_LEN (7u)

/** \brief Mask for Ifx_MCDS_SRI2AC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDS_SRI2AC_MSK_SUBCHANNEL_MSK (0x7fu)

/** \brief Offset for Ifx_MCDS_SRI2AC_MSK_Bits.SUBCHANNEL */
#define IFX_MCDS_SRI2AC_MSK_SUBCHANNEL_OFF (5u)

/** \brief Length for Ifx_MCDS_SRI2AC_MSK_Bits.WR */
#define IFX_MCDS_SRI2AC_MSK_WR_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRI2AC_MSK_Bits.WR */
#define IFX_MCDS_SRI2AC_MSK_WR_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRI2AC_MSK_Bits.WR */
#define IFX_MCDS_SRI2AC_MSK_WR_OFF (12u)

/** \brief Length for Ifx_MCDS_SRI2AC_MSK_Bits.RD */
#define IFX_MCDS_SRI2AC_MSK_RD_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRI2AC_MSK_Bits.RD */
#define IFX_MCDS_SRI2AC_MSK_RD_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRI2AC_MSK_Bits.RD */
#define IFX_MCDS_SRI2AC_MSK_RD_OFF (13u)

/** \brief Length for Ifx_MCDS_SRI2AC_MSK_Bits.MSK */
#define IFX_MCDS_SRI2AC_MSK_MSK_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRI2AC_MSK_Bits.MSK */
#define IFX_MCDS_SRI2AC_MSK_MSK_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRI2AC_MSK_Bits.MSK */
#define IFX_MCDS_SRI2AC_MSK_MSK_OFF (14u)

/** \brief Length for Ifx_MCDS_SRI2DTUFLV_Bits.CURLVL0 */
#define IFX_MCDS_SRI2DTUFLV_CURLVL0_LEN (4u)

/** \brief Mask for Ifx_MCDS_SRI2DTUFLV_Bits.CURLVL0 */
#define IFX_MCDS_SRI2DTUFLV_CURLVL0_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_SRI2DTUFLV_Bits.CURLVL0 */
#define IFX_MCDS_SRI2DTUFLV_CURLVL0_OFF (0u)

/** \brief Length for Ifx_MCDS_SRI2DTUFLV_Bits.MAXLVL0 */
#define IFX_MCDS_SRI2DTUFLV_MAXLVL0_LEN (4u)

/** \brief Mask for Ifx_MCDS_SRI2DTUFLV_Bits.MAXLVL0 */
#define IFX_MCDS_SRI2DTUFLV_MAXLVL0_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_SRI2DTUFLV_Bits.MAXLVL0 */
#define IFX_MCDS_SRI2DTUFLV_MAXLVL0_OFF (4u)

/** \brief Length for Ifx_MCDS_SRI2DTUFLV_Bits.CURLVL1 */
#define IFX_MCDS_SRI2DTUFLV_CURLVL1_LEN (4u)

/** \brief Mask for Ifx_MCDS_SRI2DTUFLV_Bits.CURLVL1 */
#define IFX_MCDS_SRI2DTUFLV_CURLVL1_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_SRI2DTUFLV_Bits.CURLVL1 */
#define IFX_MCDS_SRI2DTUFLV_CURLVL1_OFF (8u)

/** \brief Length for Ifx_MCDS_SRI2DTUFLV_Bits.MAXLVL1 */
#define IFX_MCDS_SRI2DTUFLV_MAXLVL1_LEN (4u)

/** \brief Mask for Ifx_MCDS_SRI2DTUFLV_Bits.MAXLVL1 */
#define IFX_MCDS_SRI2DTUFLV_MAXLVL1_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_SRI2DTUFLV_Bits.MAXLVL1 */
#define IFX_MCDS_SRI2DTUFLV_MAXLVL1_OFF (12u)

/** \brief Length for Ifx_MCDS_SRIEVT_Bits.EIQ0 */
#define IFX_MCDS_SRIEVT_EIQ0_LEN (2u)

/** \brief Mask for Ifx_MCDS_SRIEVT_Bits.EIQ0 */
#define IFX_MCDS_SRIEVT_EIQ0_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SRIEVT_Bits.EIQ0 */
#define IFX_MCDS_SRIEVT_EIQ0_OFF (0u)

/** \brief Length for Ifx_MCDS_SRIEVT_Bits.EIQ1 */
#define IFX_MCDS_SRIEVT_EIQ1_LEN (2u)

/** \brief Mask for Ifx_MCDS_SRIEVT_Bits.EIQ1 */
#define IFX_MCDS_SRIEVT_EIQ1_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SRIEVT_Bits.EIQ1 */
#define IFX_MCDS_SRIEVT_EIQ1_OFF (2u)

/** \brief Length for Ifx_MCDS_SRIEVT_Bits.EIQ2 */
#define IFX_MCDS_SRIEVT_EIQ2_LEN (2u)

/** \brief Mask for Ifx_MCDS_SRIEVT_Bits.EIQ2 */
#define IFX_MCDS_SRIEVT_EIQ2_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SRIEVT_Bits.EIQ2 */
#define IFX_MCDS_SRIEVT_EIQ2_OFF (4u)

