HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMcds_bf.h
/** \brief Mask for Ifx_MCDS_SRIACT_Bits.AIS3 */
#define IFX_MCDS_SRIACT_AIS3_MSK (0x1fu)

/** \brief Offset for Ifx_MCDS_SRIACT_Bits.AIS3 */
#define IFX_MCDS_SRIACT_AIS3_OFF (24u)

/** \brief Length for Ifx_MCDS_SRIACT_Bits.AIQ3 */
#define IFX_MCDS_SRIACT_AIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDS_SRIACT_Bits.AIQ3 */
#define IFX_MCDS_SRIACT_AIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_SRIACT_Bits.AIQ3 */
#define IFX_MCDS_SRIACT_AIQ3_OFF (29u)

/** \brief Length for Ifx_MCDS_SRIACT_Bits.LV3 */
#define IFX_MCDS_SRIACT_LV3_LEN (1u)

/** \brief Mask for Ifx_MCDS_SRIACT_Bits.LV3 */
#define IFX_MCDS_SRIACT_LV3_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_SRIACT_Bits.LV3 */
#define IFX_MCDS_SRIACT_LV3_OFF (31u)

/** \brief Length for Ifx_MCDS_TCZDCSTS_Bits.SUS */
#define IFX_MCDS_TCZDCSTS_SUS_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZDCSTS_Bits.SUS */
#define IFX_MCDS_TCZDCSTS_SUS_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZDCSTS_Bits.SUS */
#define IFX_MCDS_TCZDCSTS_SUS_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZDCSTS_Bits.IDLE */
#define IFX_MCDS_TCZDCSTS_IDLE_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZDCSTS_Bits.IDLE */
#define IFX_MCDS_TCZDCSTS_IDLE_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZDCSTS_Bits.IDLE */
#define IFX_MCDS_TCZDCSTS_IDLE_OFF (1u)

/** \brief Length for Ifx_MCDS_TCZDCSTS_Bits.HALT */
#define IFX_MCDS_TCZDCSTS_HALT_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZDCSTS_Bits.HALT */
#define IFX_MCDS_TCZDCSTS_HALT_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZDCSTS_Bits.HALT */
#define IFX_MCDS_TCZDCSTS_HALT_OFF (2u)

/** \brief Length for Ifx_MCDS_TCZDCSTS_Bits.ISR */
#define IFX_MCDS_TCZDCSTS_ISR_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZDCSTS_Bits.ISR */
#define IFX_MCDS_TCZDCSTS_ISR_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZDCSTS_Bits.ISR */
#define IFX_MCDS_TCZDCSTS_ISR_OFF (3u)

/** \brief Length for Ifx_MCDS_TCZDCSTS_Bits.HBRK */
#define IFX_MCDS_TCZDCSTS_HBRK_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZDCSTS_Bits.HBRK */
#define IFX_MCDS_TCZDCSTS_HBRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZDCSTS_Bits.HBRK */
#define IFX_MCDS_TCZDCSTS_HBRK_OFF (4u)

/** \brief Length for Ifx_MCDS_TCZDCSTS_Bits.SBRK */
#define IFX_MCDS_TCZDCSTS_SBRK_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZDCSTS_Bits.SBRK */
#define IFX_MCDS_TCZDCSTS_SBRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZDCSTS_Bits.SBRK */
#define IFX_MCDS_TCZDCSTS_SBRK_OFF (5u)

/** \brief Length for Ifx_MCDS_TCZDCSTS_Bits.IEN */
#define IFX_MCDS_TCZDCSTS_IEN_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZDCSTS_Bits.IEN */
#define IFX_MCDS_TCZDCSTS_IEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZDCSTS_Bits.IEN */
#define IFX_MCDS_TCZDCSTS_IEN_OFF (7u)

/** \brief Length for Ifx_MCDS_TCZDCSTS_Bits.DBGEN */
#define IFX_MCDS_TCZDCSTS_DBGEN_LEN (1u)

/** \brief Mask for Ifx_MCDS_TCZDCSTS_Bits.DBGEN */
#define IFX_MCDS_TCZDCSTS_DBGEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDS_TCZDCSTS_Bits.DBGEN */
#define IFX_MCDS_TCZDCSTS_DBGEN_OFF (8u)

/** \brief Length for Ifx_MCDS_TCZDCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCZDCSTS_CLKDIV_LEN (2u)

/** \brief Mask for Ifx_MCDS_TCZDCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCZDCSTS_CLKDIV_MSK (0x3u)

/** \brief Offset for Ifx_MCDS_TCZDCSTS_Bits.CLKDIV */
#define IFX_MCDS_TCZDCSTS_CLKDIV_OFF (9u)

/** \brief Length for Ifx_MCDS_TCZDCSTS_Bits.NESTED_ISR */
#define IFX_MCDS_TCZDCSTS_NESTED_ISR_LEN (4u)

/** \brief Mask for Ifx_MCDS_TCZDCSTS_Bits.NESTED_ISR */
#define IFX_MCDS_TCZDCSTS_NESTED_ISR_MSK (0xfu)

/** \brief Offset for Ifx_MCDS_TCZDCSTS_Bits.NESTED_ISR */
#define IFX_MCDS_TCZDCSTS_NESTED_ISR_OFF (11u)

/** \brief Length for Ifx_MCDS_TCZCID_Bits.CURRENT */
#define IFX_MCDS_TCZCID_CURRENT_LEN (3u)

/** \brief Mask for Ifx_MCDS_TCZCID_Bits.CURRENT */
#define IFX_MCDS_TCZCID_CURRENT_MSK (0x7u)

/** \brief Offset for Ifx_MCDS_TCZCID_Bits.CURRENT */
#define IFX_MCDS_TCZCID_CURRENT_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZCIP_Bits.CURRENT */
#define IFX_MCDS_TCZCIP_CURRENT_LEN (31u)

/** \brief Mask for Ifx_MCDS_TCZCIP_Bits.CURRENT */
#define IFX_MCDS_TCZCIP_CURRENT_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDS_TCZCIP_Bits.CURRENT */
#define IFX_MCDS_TCZCIP_CURRENT_OFF (1u)

/** \brief Length for Ifx_MCDS_TCZCFT_Bits.VSHRT_FCT */
#define IFX_MCDS_TCZCFT_VSHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCZCFT_Bits.VSHRT_FCT */
#define IFX_MCDS_TCZCFT_VSHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCZCFT_Bits.VSHRT_FCT */
#define IFX_MCDS_TCZCFT_VSHRT_FCT_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZCFT_Bits.SHRT_FCT */
#define IFX_MCDS_TCZCFT_SHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCZCFT_Bits.SHRT_FCT */
#define IFX_MCDS_TCZCFT_SHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCZCFT_Bits.SHRT_FCT */
#define IFX_MCDS_TCZCFT_SHRT_FCT_OFF (16u)

/** \brief Length for Ifx_MCDS_TCZPALLUTD_Bits.DATA */
#define IFX_MCDS_TCZPALLUTD_DATA_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCZPALLUTD_Bits.DATA */
#define IFX_MCDS_TCZPALLUTD_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCZPALLUTD_Bits.DATA */
#define IFX_MCDS_TCZPALLUTD_DATA_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZPALLUTA_Bits.ADDR */
#define IFX_MCDS_TCZPALLUTA_ADDR_LEN (10u)

/** \brief Mask for Ifx_MCDS_TCZPALLUTA_Bits.ADDR */
#define IFX_MCDS_TCZPALLUTA_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDS_TCZPALLUTA_Bits.ADDR */
#define IFX_MCDS_TCZPALLUTA_ADDR_OFF (2u)

/** \brief Length for Ifx_MCDS_TCZPAL_BND_Bits.BOUND */
#define IFX_MCDS_TCZPAL_BND_BOUND_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCZPAL_BND_Bits.BOUND */
#define IFX_MCDS_TCZPAL_BND_BOUND_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCZPAL_BND_Bits.BOUND */
#define IFX_MCDS_TCZPAL_BND_BOUND_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZPAL_RNG_Bits.RANGE */
#define IFX_MCDS_TCZPAL_RNG_RANGE_LEN (32u)

/** \brief Mask for Ifx_MCDS_TCZPAL_RNG_Bits.RANGE */
#define IFX_MCDS_TCZPAL_RNG_RANGE_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDS_TCZPAL_RNG_Bits.RANGE */
#define IFX_MCDS_TCZPAL_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MCDS_TCZPAL_MAP_Bits.OFFSET */
#define IFX_MCDS_TCZPAL_MAP_OFFSET_LEN (10u)

